In [1]:
sc

In [2]:
spark

In [3]:
people_df = spark.read.json("file:///home/hadoop/Downloads/people.json")
people_df.head()

Row(city='Mulyosari', country='Indonesia', first_name='Valma', gender='Female', id=1, last_name='Sans', salary=983107)

In [4]:
people_df.show()

+------------------+------------+----------+------+---+---------+------+
|              city|     country|first_name|gender| id|last_name|salary|
+------------------+------------+----------+------+---+---------+------+
|         Mulyosari|   Indonesia|     Valma|Female|  1|     Sans|983107|
|           Niihama|       Japan|     Paolo|  Male|  2|   Kiddie|649173|
|         Dū Qal‘ah| Afghanistan|    Miltie|  Male|  3| De Zuani|352898|
|            Iberia|        Peru|    Jarrid|  Male|  4| Dalziell|170398|
|          La Ronge|      Canada| Reinaldos|  Male|  5|   Keeffe|440989|
|      Kuala Lumpur|    Malaysia|        Eb|  Male|  6|Schwanden|274126|
|         Al Qurayn|Saudi Arabia|    Alleyn|  Male|  7|   Paddon|681914|
|           Jixiang|       China|   Baryram|  Male|  8|     Yell|250748|
|Thị Trấn Phong Thổ|     Vietnam|     Cammy|Female|  9|     Axel|221750|
|        Kotatengah|   Indonesia|       Erl|  Male| 10|  Caldera|680801|
|        Roldanillo|    Colombia|    Miguel|  Male| 11|   Moules|819771|
|            Malārd|        Iran| Mireielle|Female| 12|   Hurley|486029|
|     Fada N'gourma|Burkina Faso|    Feodor|  Male| 13| Grummitt|358045|
|           Ciangir|   Indonesia|     Diana|Female| 14|  Lawfull|397683|
|         El Cantón|   Venezuela|      Evie|Female| 15|   Kaysor|436202|
|          La Unión|    Colombia|    Janean|Female| 16|    Sayse|892405|
|            Xinhua|       China|     Colan|  Male| 17|   Stoppe|218434|
|     Крива Паланка|   Macedonia|      Erik|  Male| 18| Stitcher|776023|
|          Qīr Moāv|      Jordan|   Sargent|  Male| 19|   Cleall|819269|
|      Bogandinskiy|      Russia|   Tamqrah|Female| 20|Millichip|313540|
+------------------+------------+----------+------+---+---------+------+
only showing top 20 rows

In [6]:
bank_data = spark.read.json("file:///home/hadoop/Downloads/bank_edited.json",multiLine=True)
bank_data.head()

Row(age=58, balance=2143, campaign=1, contact='unknown', day=5, default='no', duration=261, education='tertiary', housing='yes', job='management', loan='no', marital='married', month='may', pdays=-1, poutcome='unknown', previous=0, y='no')

In [7]:
bank_data.show()

+---+-------+--------+-------+---+-------+--------+---------+-------+------------+----+--------+-----+-----+--------+--------+---+
|age|balance|campaign|contact|day|default|duration|education|housing|         job|loan| marital|month|pdays|poutcome|previous|  y|
+---+-------+--------+-------+---+-------+--------+---------+-------+------------+----+--------+-----+-----+--------+--------+---+
| 58|   2143|       1|unknown|  5|     no|     261| tertiary|    yes|  management|  no| married|  may|   -1| unknown|       0| no|
| 44|     29|       1|unknown|  5|     no|     151|secondary|    yes|  technician|  no|  single|  may|   -1| unknown|       0| no|
| 33|      2|       1|unknown|  5|     no|      76|secondary|    yes|entrepreneur| yes| married|  may|   -1| unknown|       0| no|
| 47|   1506|       1|unknown|  5|     no|      92|  unknown|    yes| blue-collar|  no| married|  may|   -1| unknown|       0| no|
| 33|      1|       1|unknown|  5|     no|     198|  unknown|     no|     unknown|  no|  single|  may|   -1| unknown|       0| no|
| 35|    231|       1|unknown|  5|     no|     139| tertiary|    yes|  management|  no| married|  may|   -1| unknown|       0| no|
| 28|    447|       1|unknown|  5|     no|     217| tertiary|    yes|  management| yes|  single|  may|   -1| unknown|       0| no|
| 42|      2|       1|unknown|  5|    yes|     380| tertiary|    yes|entrepreneur|  no|divorced|  may|   -1| unknown|       0| no|
| 58|    121|       1|unknown|  5|     no|      50|  primary|    yes|     retired|  no| married|  may|   -1| unknown|       0| no|
| 43|    593|       1|unknown|  5|     no|      55|secondary|    yes|  technician|  no|  single|  may|   -1| unknown|       0| no|
| 41|    270|       1|unknown|  5|     no|     222|secondary|    yes|      admin.|  no|divorced|  may|   -1| unknown|       0| no|
| 29|    390|       1|unknown|  5|     no|     137|secondary|    yes|      admin.|  no|  single|  may|   -1| unknown|       0| no|
| 53|      6|       1|unknown|  5|     no|     517|secondary|    yes|  technician|  no| married|  may|   -1| unknown|       0| no|
| 58|     71|       1|unknown|  5|     no|      71|  unknown|    yes|  technician|  no| married|  may|   -1| unknown|       0| no|
| 57|    162|       1|unknown|  5|     no|     174|secondary|    yes|    services|  no| married|  may|   -1| unknown|       0| no|
| 51|    229|       1|unknown|  5|     no|     353|  primary|    yes|     retired|  no| married|  may|   -1| unknown|       0| no|
| 45|     13|       1|unknown|  5|     no|      98|  unknown|    yes|      admin.|  no|  single|  may|   -1| unknown|       0| no|
| 57|     52|       1|unknown|  5|     no|      38|  primary|    yes| blue-collar|  no| married|  may|   -1| unknown|       0| no|
| 60|     60|       1|unknown|  5|     no|     219|  primary|    yes|     retired|  no| married|  may|   -1| unknown|       0| no|
| 33|      0|       1|unknown|  5|     no|      54|secondary|    yes|    services|  no| married|  may|   -1| unknown|       0| no|
+---+-------+--------+-------+---+-------+--------+---------+-------+------------+----+--------+-----+-----+--------+--------+---+
only showing top 20 rows

In [9]:
bank_data.printSchema()

root
 |-- age: long (nullable = true)
 |-- balance: long (nullable = true)
 |-- campaign: long (nullable = true)
 |-- contact: string (nullable = true)
 |-- day: long (nullable = true)
 |-- default: string (nullable = true)
 |-- duration: long (nullable = true)
 |-- education: string (nullable = true)
 |-- housing: string (nullable = true)
 |-- job: string (nullable = true)
 |-- loan: string (nullable = true)
 |-- marital: string (nullable = true)
 |-- month: string (nullable = true)
 |-- pdays: long (nullable = true)
 |-- poutcome: string (nullable = true)
 |-- previous: long (nullable = true)
 |-- y: string (nullable = true)

In [14]:
from pyspark.sql.functions import *
from pyspark.sql.types import IntegerType,StructType,StructField,StringType,FloatType
from pyspark.sql.types import *

In [16]:
schema = StructType([
    StructField("id",IntegerType(),True),
    StructField("first_name",StringType(),True),
    StructField("last_name",StringType(),True),
    StructField("gender",StringType(),True),
    StructField("salary",LongType(),True),
    StructField("city",StringType(),True),
    StructField("country",StringType(),True)
])

In [17]:
people_df = spark.read.schema(schema).json("file:///home/hadoop/Downloads/people.json")

In [18]:
people_df.show()

+---+----------+---------+------+------+------------------+------------+
| id|first_name|last_name|gender|salary|              city|     country|
+---+----------+---------+------+------+------------------+------------+
|  1|     Valma|     Sans|Female|983107|         Mulyosari|   Indonesia|
|  2|     Paolo|   Kiddie|  Male|649173|           Niihama|       Japan|
|  3|    Miltie| De Zuani|  Male|352898|         Dū Qal‘ah| Afghanistan|
|  4|    Jarrid| Dalziell|  Male|170398|            Iberia|        Peru|
|  5| Reinaldos|   Keeffe|  Male|440989|          La Ronge|      Canada|
|  6|        Eb|Schwanden|  Male|274126|      Kuala Lumpur|    Malaysia|
|  7|    Alleyn|   Paddon|  Male|681914|         Al Qurayn|Saudi Arabia|
|  8|   Baryram|     Yell|  Male|250748|           Jixiang|       China|
|  9|     Cammy|     Axel|Female|221750|Thị Trấn Phong Thổ|     Vietnam|
| 10|       Erl|  Caldera|  Male|680801|        Kotatengah|   Indonesia|
| 11|    Miguel|   Moules|  Male|819771|        Roldanillo|    Colombia|
| 12| Mireielle|   Hurley|Female|486029|            Malārd|        Iran|
| 13|    Feodor| Grummitt|  Male|358045|     Fada N'gourma|Burkina Faso|
| 14|     Diana|  Lawfull|Female|397683|           Ciangir|   Indonesia|
| 15|      Evie|   Kaysor|Female|436202|         El Cantón|   Venezuela|
| 16|    Janean|    Sayse|Female|892405|          La Unión|    Colombia|
| 17|     Colan|   Stoppe|  Male|218434|            Xinhua|       China|
| 18|      Erik| Stitcher|  Male|776023|     Крива Паланка|   Macedonia|
| 19|   Sargent|   Cleall|  Male|819269|          Qīr Moāv|      Jordan|
| 20|   Tamqrah|Millichip|Female|313540|      Bogandinskiy|      Russia|
+---+----------+---------+------+------+------------------+------------+
only showing top 20 rows

In [19]:
people_df.printSchema()

root
 |-- id: integer (nullable = true)
 |-- first_name: string (nullable = true)
 |-- last_name: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: long (nullable = true)
 |-- city: string (nullable = true)
 |-- country: string (nullable = true)

### 2.withColumn()

In [20]:
#here with column will create new column name "new_salary"
people_df = people_df.withColumn('updated_salary', people_df['salary'] + people_df['salary'] * 0.1)

In [21]:
people_df.show()

+---+----------+---------+------+------+------------------+------------+--------------+
| id|first_name|last_name|gender|salary|              city|     country|updated_salary|
+---+----------+---------+------+------+------------------+------------+--------------+
|  1|     Valma|     Sans|Female|983107|         Mulyosari|   Indonesia|     1081417.7|
|  2|     Paolo|   Kiddie|  Male|649173|           Niihama|       Japan|      714090.3|
|  3|    Miltie| De Zuani|  Male|352898|         Dū Qal‘ah| Afghanistan|      388187.8|
|  4|    Jarrid| Dalziell|  Male|170398|            Iberia|        Peru|      187437.8|
|  5| Reinaldos|   Keeffe|  Male|440989|          La Ronge|      Canada|      485087.9|
|  6|        Eb|Schwanden|  Male|274126|      Kuala Lumpur|    Malaysia|      301538.6|
|  7|    Alleyn|   Paddon|  Male|681914|         Al Qurayn|Saudi Arabia|      750105.4|
|  8|   Baryram|     Yell|  Male|250748|           Jixiang|       China|      275822.8|
|  9|     Cammy|     Axel|Female|221750|Thị Trấn Phong Thổ|     Vietnam|      243925.0|
| 10|       Erl|  Caldera|  Male|680801|        Kotatengah|   Indonesia|      748881.1|
| 11|    Miguel|   Moules|  Male|819771|        Roldanillo|    Colombia|      901748.1|
| 12| Mireielle|   Hurley|Female|486029|            Malārd|        Iran|      534631.9|
| 13|    Feodor| Grummitt|  Male|358045|     Fada N'gourma|Burkina Faso|      393849.5|
| 14|     Diana|  Lawfull|Female|397683|           Ciangir|   Indonesia|      437451.3|
| 15|      Evie|   Kaysor|Female|436202|         El Cantón|   Venezuela|      479822.2|
| 16|    Janean|    Sayse|Female|892405|          La Unión|    Colombia|      981645.5|
| 17|     Colan|   Stoppe|  Male|218434|            Xinhua|       China|      240277.4|
| 18|      Erik| Stitcher|  Male|776023|     Крива Паланка|   Macedonia|      853625.3|
| 19|   Sargent|   Cleall|  Male|819269|          Qīr Moāv|      Jordan|      901195.9|
| 20|   Tamqrah|Millichip|Female|313540|      Bogandinskiy|      Russia|      344894.0|
+---+----------+---------+------+------+------------------+------------+--------------+
only showing top 20 rows

In [23]:
#Limit - To Limit first 5 records

people_df.limit(5).show()

+---+----------+---------+------+------+---------+-----------+--------------+
| id|first_name|last_name|gender|salary|     city|    country|updated_salary|
+---+----------+---------+------+------+---------+-----------+--------------+
|  1|     Valma|     Sans|Female|983107|Mulyosari|  Indonesia|     1081417.7|
|  2|     Paolo|   Kiddie|  Male|649173|  Niihama|      Japan|      714090.3|
|  3|    Miltie| De Zuani|  Male|352898|Dū Qal‘ah|Afghanistan|      388187.8|
|  4|    Jarrid| Dalziell|  Male|170398|   Iberia|       Peru|      187437.8|
|  5| Reinaldos|   Keeffe|  Male|440989| La Ronge|     Canada|      485087.9|
+---+----------+---------+------+------+---------+-----------+--------------+

### 3. Random Sampling Of Data From Sample Method

In [26]:
people_df.sample(withReplacement=False, fraction=0.05, seed = 321).show()

+---+----------+----------+------+------+--------------+--------------------+--------------+
| id|first_name| last_name|gender|salary|          city|             country|updated_salary|
+---+----------+----------+------+------+--------------+--------------------+--------------+
|  3|    Miltie|  De Zuani|  Male|352898|     Dū Qal‘ah|         Afghanistan|      388187.8|
| 11|    Miguel|    Moules|  Male|819771|    Roldanillo|            Colombia|      901748.1|
| 15|      Evie|    Kaysor|Female|436202|     El Cantón|           Venezuela|      479822.2|
| 58|      Caye|     Blazy|Female|769322|         Skien|              Norway|      846254.2|
| 77|     Ailyn|    Palmar|Female|984515|  Lonpao Dajah|           Indonesia|     1082966.5|
| 87|  Maryanna|   Petchey|Female|853991|      Subotica|              Serbia|      939390.1|
|105|   Austine|    Zelner|Female|494200|     Hangchuan|               China|      543620.0|
|129|    Antons|   Paulack|  Male|709077|     Periyiáli|              Greece|      779984.7|
|198|     Howey| Challicum|  Male|683371|    Fort Worth|       United States|      751708.1|
|205|     Denis|      Amer|  Male|741444|        Cuntan|               China|      815588.4|
|211|     Danya|   Simenon|Female|369820|       Gibsons|              Canada|      406802.0|
|225|     Ellis|   Hargitt|  Male|443136|        Carice|               Haiti|      487449.6|
|240|      Mort|Aizikovitz|  Male|818033|         Shani|             Nigeria|      899836.3|
|247|Washington|   Hradsky|  Male|732653|Horad Rechytsa|             Belarus|      805918.3|
|249|    Kelley|   Kivelle|  Male|513506|  Vila Ribeiro|            Portugal|      564856.6|
|268|   Valerye|   Lindman|Female|777748|       Malusac|         Philippines|      855522.8|
|324|     Hyman|Markushkin|  Male|753059|        Budrus|Palestinian Terri...|      828364.9|
|329|    Sabine|    Mirfin|Female|687456|       Yushang|               China|      756201.6|
|338|    Alexis|   Cluckie|Female|255470|      Yongdong|               China|      281017.0|
|353|      Dory|Bennellick|  Male|195896| Pampa Hermosa|                Peru|      215485.6|
+---+----------+----------+------+------+--------------+--------------------+--------------+
only showing top 20 rows

### Order By()
      * Arrange data in ascending or descending Order.

In [28]:
people_df.orderBy(['salary','first_name'], ascending= False).show()

+---+----------+----------+------+------+-------------------+--------------+--------------+
| id|first_name| last_name|gender|salary|               city|       country|updated_salary|
+---+----------+----------+------+------+-------------------+--------------+--------------+
|651| Frederigo|     Ogers|  Male|999360|             Pentre|United Kingdom|     1099296.0|
|652|  Hurleigh|      Plom|  Male|998944|Grodzisk Mazowiecki|        Poland|     1098838.4|
|812|      Ebba|   Brandom|Female|996994|        Dhromolaxia|        Cyprus|     1096693.4|
|565|   Isidoro|  Bartolic|  Male|996459|             Xingou|         China|     1096104.9|
|689|  Harriott|Strathearn|Female|995400|              Taiba|         China|     1094940.0|
|158|   Evelina|      Ibbs|Female|995388|     Kotawaikabubak|     Indonesia|     1094926.8|
|839|     Halsy|     Hayle|  Male|994261|               Erie| United States|     1093687.1|
|770|     Ruthe|      Brun|Female|992992|            Xintian|         China|     1092291.2|
|686|       Kip|  Kirkebye|  Male|991929|             Baiyan|         China|     1091121.9|
|131|     Harri|     Raper|Female|989626|            Hujigou|         China|     1088588.6|
|872|     Rycca|     Maund|Female|987858|               Azul|     Argentina|     1086643.8|
|194|     Hewet|    Swayne|  Male|985409|            Kazaure|       Nigeria|     1083949.9|
| 82| Hollyanne|  Heberden|Female|985194|            Citeguh|     Indonesia|     1083713.4|
|376|     Kylie|Grigorescu|Female|984966|            La Vega|      Colombia|     1083462.6|
|503|    Billye|  Rappport|Female|984735|          Nerópolis|        Brazil|     1083208.5|
| 77|     Ailyn|    Palmar|Female|984515|       Lonpao Dajah|     Indonesia|     1082966.5|
|847|    Towney|   Abraham|  Male|983631|             Iganga|        Uganda|     1081994.1|
|  1|     Valma|      Sans|Female|983107|          Mulyosari|     Indonesia|     1081417.7|
|490|  Cathlene|  Gatfield|Female|981605|            Mīrābād|   Afghanistan|     1079765.5|
|483|     Andre|  Albasiny|  Male|981190|              Blama|  Sierra Leone|     1079309.0|
+---+----------+----------+------+------+-------------------+--------------+--------------+
only showing top 20 rows

In [29]:
people_df.orderBy(['salary','first_name'], ascending= True).show()

+---+----------+----------+------+------+------------+--------------------+--------------+
| id|first_name| last_name|gender|salary|        city|             country|updated_salary|
+---+----------+----------+------+------+------------+--------------------+--------------+
| 93|      Cory|     Prigg|  Male| 12876|     Gondang|           Indonesia|       14163.6|
|590|      Flem|  Tumielli|  Male| 13347| Debre Zeyit|            Ethiopia|       14681.7|
|192|       Odo|   Conyers|  Male| 15555|  Raffingora|            Zimbabwe|       17110.5|
|407|  Barbabas| Ballingal|  Male| 18598|Beringinjaya|           Indonesia|       20457.8|
|297|     Daron|    Melato|Female| 19881|      Phayao|            Thailand|       21869.1|
| 24|   Avigdor|   Goddman|  Male| 20216|       Gujun|               China|       22237.6|
|315|    Alayne|    Foskin|Female| 20390|     Siluman|           Indonesia|       22429.0|
|199|     Niles| Atcherley|  Male| 22529|Nova Venécia|              Brazil|       24781.9|
|294|     Terri|    Holton|Female| 23934|      Hitura|               Nepal|       26327.4|
|601|    Pattie|Bosomworth|Female| 24967|   Virolahti|             Finland|       27463.7|
|762|     Jesse|   Comfort|  Male| 26213|    Żoliborz|              Poland|       28834.3|
|252|       Gil|  Rochford|  Male| 26950|        Huji|               China|       29645.0|
|837|   Sharity|  Stoffers|Female| 28630|    Zavidovo|              Russia|       31493.0|
|438|    Odelle|  Harefoot|Female| 29177| Cibatuireng|           Indonesia|       32094.7|
|836|     Lenka|  Eddicott|Female| 29374| Trincomalee|           Sri Lanka|       32311.4|
|912|    Jackie|    Baudic|Female| 29540|       Bunia|Democratic Republ...|       32494.0|
|439|     Keith|   Baudain|  Male| 31890| Maszkienice|              Poland|       35079.0|
|356| Raffaello|   Dugdale|  Male| 33082|   San Pedro|         Philippines|       36390.2|
|977|    Kalvin|     Earry|  Male| 34152|   Mariental|             Namibia|       37567.2|
|512|     Bobbe|   Copland|Female| 34435|          Mó|            Portugal|       37878.5|
+---+----------+----------+------+------+------------+--------------------+--------------+
only showing top 20 rows